import UIKit
/*
 미리 구현되어 있는 프레임 워크를 Import 허는 것이다.
 애플이 만들어 놓은 코드를 포함시켜서 작성하는 것
 애플 개발자 홈페이지에 여러가지 프레임 워크들이 존재 -> 읽을 수 있음.
 */



var str = "Hello, playground"
print(str)
dump(str)
// 존 더 상새한 값읋 볼 수 있는것이 dump 함수이다. print 값을 출력해 주는 것
// ****** 스위프트는 대소문자를 철저하게 구분하기 때문에 반듯이 대소문자를 구분해서 사용을 해야 한다!!

// 주석 슬레시 두개로 사용한다. - > Single line 주석이다.
// Comend + / 로 주석을 처리하고 해제 할 수 있다.
// 살시간으로 오류를 추적해 주는 기능을 Live Issue 라고 하며
// 발견한 오류를 수정해 주는 기능을 Fix-it 이라고 한다. -> 문법을 공부할 때에는 꾀 유용한 도구이다.
// 하지만 무조건 fix 버튼을 눌러서 해결하는 것이 아니라 왜 발생한 오류인지를 인지하고 가야 한다.

/*
 이렇게 (/)와 (*)로 진행된 것을 Mult Line 주석이라고 한다.
 자신과 동료를 위해서 상세한 주석을 달아 놓는 것이 중요하다.
 나중에 다시보거나 다른 사람들을 위해서 작은 내용이라도 주석으로 남겨 놓는 것이 중요하다.
 */

